docs/api/cfd/cases/dam_break/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     interFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.5;
deltaT          0.001;
writeControl    adjustable;
writeInterval   0.01;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           1;
maxAlphaCo      1;
maxDeltaT       1;
functions
{
    // Total water volume each time step: mass-conservation gate (< 1% drift).
    waterVolume
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
    }
}
