docs/api/cfd/cases/dam_break/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType  laminar;
