docs/api/cfd/cases/dam_break/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }

phases          (water air);
water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}
air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}
sigma            0.07;
