docs/api/cfd/cases/dam_break/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }

defaultFieldValues ( volScalarFieldValue alpha.water 0 );
regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 0.2922 1);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);
